name_user = input("Введите свое имя : ")
print("Привет", name_user, "!", "Меня зовут Махмуд ака, я искустренный интелект ")
ears = int(input("Укажите свой возраст в числовом формате : "))
sex = input(" Укажите свой пол , муж / жен : ")
if ears < 18 and sex == "жен":
    print("Стоп! вам нет 18 лет")
else:
    if ears >= 18 and sex == "муж" or sex == "жен":

name_user = input("Введите свое имя : ")
print("Привет", name_user, "!", "Меня зовут Махмуд ака, я искусственный интеллект ")
ears = int(input("Укажите свой возраст в числовом формате : "))
sex = input(" Укажите свой пол , муж / жен : ")
if ears < 18 and sex == "жен":
    print("Стоп! вам нет 18 лет")
else:
    if ears >= 18 and sex == "муж" or sex == "жен":
      print("я очень полезен и силен в математике позвольте доказать.")
      a = float(input("Введите перво число : "))
      b = float(input("Введите перво число : "))
      print("Сумма чисел", a + b)
      print("Разность чисел", a - b)
      print("Произведение чисел", a * b)
