a = ["Roman", 123456, "m"] #Первое задание
n = len(a)
i = 0
while i <= n - 1:
    print(a[i])
    i = i + 1
###########################################################

n = [] #Второе задание
x = 1
while x != 0:
    x = int(input("Вводите числа подряд: "))
    n.append(x)
print(sum(n))

###########################################################

a = (input("Введите цену за килограмм асфальта : ")) #Третье задание
b = a[::-1]
print(b)

###########################################################

a = "Hello, " # пятое задание
b = "world!"
print(a + b)
a, b = b, a
print(a + b)

############################################################

